0xsmirk/mcu_cmsis_svd/NXP/LPC11Axxv0.6.svd
			</field>														
			<field>														
				<name>AD5SEL</name>													
				<description>This field selects the source signal for channel 5.</description>													
				<bitRange>[11:10]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>AD5_PIN</name>											
						<description>AD5 pin</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>NO_CONNECTION_OR_LOA</name>											
						<description>No connection or load</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>CORE_VOLTAGE_REGULAT</name>											
						<description>Core voltage regulator output (1.2 to 1.8V)</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>RESERVED_DO_NOT_PRO</name>											
						<description>Reserved. Do not program this value.</description>											
						<value>0x3</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>AD6SEL</name>													
				<description>This field selects the source signal for channel 6.</description>													
				<bitRange>[13:12]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>AD6_PIN</name>											
						<description>AD6 pin</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>NO_CONNECTION_OR_LOA</name>											
						<description>No connection or load</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>INTERNAL_VOLTAGE_REF</name>											
						<description>Internal voltage reference</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>RESERVED_DO_NOT_PRO</name>											
						<description>Reserved. Do not program this value.</description>											
						<value>0x3</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>AD7SEL</name>													
				<description>This field selects the source signal for channel 7.</description>													
				<bitRange>[15:14]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>AD7_PIN</name>											
						<description>AD7 pin</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>NO_CONNECTION_OR_LOA</name>											
						<description>No connection or load</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>TEMPERATURE_SENSOR</name>											
						<description>Temperature sensor</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>RESERVED_DO_NOT_PRO</name>											
						<description>Reserved. Do not program this value.</description>											
						<value>0x3</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Always write zeroes to these bits.</description>													
				<bitRange>[31:16]</bitRange>													
												
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>STAT</name>															
		<description>A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt flag.</description>															
		<addressOffset>0x030</addressOffset>															
		<access>read-only</access>															
		<resetValue>0</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>DONE</name>													
				<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>OVERRUN</name>													
				<description>These bits mirror the OVERRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>													
				<bitRange>[15:8]</bitRange>													
			</field>														
			<field>														
				<name>ADINT</name>													
				<description>This bit is the A/D interrupt flag. It is one when any of the individual A/D channel Done flags is asserted and enabled to contribute to the A/D interrupt via the ADINTEN register.</description>													
				<bitRange>[16:16]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Always 0.</description>													
				<bitRange>[31:17]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>INTEN</name>															
		<description>A/D Interrupt Enable Register. This register contains enable bits that allow the DONE flag of each A/D channel to be included or excluded from contributing to the generation of an A/D interrupt.</description>															
		<addressOffset>0x00C</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x00000100</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>ADINTEN</name>													
				<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>ADGINTEN</name>													
				<description>When 1, enables the global DONE flag in ADDR to generate an interrupt. When 0, only the individual A/D channels enabled by ADINTEN 7:0 will generate interrupts.</description>													
				<bitRange>[8:8]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Always 0.</description>													
				<bitRange>[31:9]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<dim>8</dim>															
		<dimIncrement>0x4</dimIncrement>															
		<dimIndex>0-7</dimIndex>															
		<name>DR%s</name>															
		<description>A/D Channel 0 Data Register. This register contains the result of the most recent conversion completed on channel 0</description>															
		<addressOffset>0x010</addressOffset>															
		<access>read-only</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. These bits always read as zeroes.</description>													
				<bitRange>[5:0]</bitRange>													
			</field>														
			<field>														
				<name>V_VREF</name>													
				<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin, divided by the voltage on the VREF pin. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREF, while 0x3FF indicates that the voltage on AD input was close to, equal to, or greater than that on VREF.</description>													
				<bitRange>[15:6]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. These bits always read as zeroes. They allow accumulation of successive A/D values without AND-masking for at least 256 values without overflow into the CHN field.</description>													
				<bitRange>[29:16]</bitRange>													
			</field>														
			<field>														
				<name>OVERRUN</name>													
				<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the LS bits.This bit is cleared by reading this register.</description>													
				<bitRange>[30:30]</bitRange>													
			</field>														
			<field>														
				<name>DONE</name>													
				<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>													
				<bitRange>[31:31]</bitRange>													
			</field>														
		</fields>															
	</register>																
