0xsmirk/mcu_cmsis_svd/NXP/LPC11Axxv0.6.svd
					</field>																				
					<field>																				
						<name>EDGECLR</name>																			
						<description>Interrupt clear bit. Writing a 1 to this bit clears the COMPEDGE bit (bit 23 below) and thus negates the interrupt request.</description>																			
						<bitRange>[20:20]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>COMPSTAT</name>																			
						<description>Comparator status. This bit reflects the state of the comparator output.</description>																			
						<bitRange>[21:21]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved. Write as 0.</description>																			
						<bitRange>[22:22]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>COMPEDGE</name>																			
						<description>Comparator edge-detect status.</description>																			
						<bitRange>[23:23]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved. Write as 0.</description>																			
						<bitRange>[24:24]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>HYS</name>																			
						<description>Controls the hysteresis of the comparator. When the comparator is outputting a certain state, this is the difference between the selected signals, in the opposite direction from the state being output, that will switch the output.</description>																			
						<bitRange>[26:25]</bitRange>																			
						<enumeratedValues>																			
						<name>ENUM</name>																			
							<enumeratedValue>																		
								<name>NOHYSTERESIS</name>																	
								<description>None (the output will switch as the voltages cross)</description>																	
								<value>0x0</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>HYS5MV</name>																	
								<description>5 mV</description>																	
								<value>0x1</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>HSY10MV</name>																	
								<description>10 mV</description>																	
								<value>0x2</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>HSY20MV</name>																	
								<description>20 mV</description>																	
								<value>0x3</value>																	
							</enumeratedValue>																		
						</enumeratedValues>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:27]</bitRange>																			
																							
					</field>																				
				</fields>																					
			</register>																						
			<register>																						
				<name>LAD</name>																					
				<description>Voltage ladder register</description>																					
				<addressOffset>0x004</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>LADEN</name>																			
						<description>Voltage ladder enable</description>																			
						<bitRange>[0:0]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>LADSEL</name>																			
						<description>Voltage ladder value. The reference voltage Vref depends on the LADREF bit below. 00000 = VSS 00001 = 1  Vref/31 00010 = 2  Vref/31 ... 11111 = Vref</description>																			
						<bitRange>[5:1]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>LADREF</name>																			
						<description>Selects the reference voltage for the voltage ladder</description>																			
						<bitRange>[6:6]</bitRange>																			
						<enumeratedValues>																			
						<name>ENUM</name>																			
							<enumeratedValue>																		
								<name>VDDPIN</name>																	
								<description>VDD pin</description>																	
								<value>0</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>VDDCMPPIN</name>																	
								<description>VDDCMP pin</description>																	
								<value>1</value>																	
							</enumeratedValue>																		
						</enumeratedValues>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Unused</description>																			
						<bitRange>[31:7]</bitRange>																			
																							
					</field>																				
				</fields>																					
			</register>																						
		</registers>																							
	
	</peripheral>
		
		<peripheral>
	<name>FMC</name>
	<description>Flash controller</description>
	<groupName>FLASHCTRL</groupName>
	<baseAddress>0x4003C000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>FMC</name>
	<value>27</value>
	</interrupt>
	<registers>
		<register>
			<name>EEMSSTART</name>
			<description>EEPROM BIST start address register</description>
			<addressOffset>0x09C</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STARTA</name>
					<description>BIST start address: Bit 0 is fixed zero since only even addresses are allowed.</description>
					<bitRange>[13:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EEMSSTOP</name>
			<description>EEPROM BIST stop address register</description>
			<addressOffset>0x0A0</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STOPA</name>
					<description>BIST stop address: Bit 0 is fixed zero since only even addresses are allowed.</description>
					<bitRange>[13:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[29:14]</bitRange>
				</field>
				<field>
					<name>DEVSEL</name>
					<description>BIST device select bit 0: the BIST signature is generated over the total memory space. Singe pages are interleaved over the EEPROM devices when multiple devices are used, the signature is generated over memory of multiple devices. 1: the BIST signature is generated only over a memory range located on a single EEPROM device. Therefore the internal address generation is done such that the  address' CS bits are kept stable to select only the same device. The address' MSB and LSB bits are used to step through the memory range specified by the start and stop address fields. Note: if this bit is set the start and stop address fields must be programmed such that they both address the same EEPROM device. Therefore the address' CS bits in both the start and stop address must be the same.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>STRTBIST</name>
					<description>BIST start bit Setting this bit will start the BIST. This bit is self-clearing.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EEMSSIG</name>
			<description>EEPROM 24-bit BIST signature register</description>
			<addressOffset>0x0A4</addressOffset>
			<access>read-only</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA_SIG</name>
					<description>BIST 16-bit signature calculated from only the data bytes</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>PARITY_SIG</name>
					<description>BIST 16-bit signature calculated from only the parity bits of the data bytes</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>FLASHCFG</name>
			<description>Flash memory access time configuration register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>FLASHTIM</name>
					<description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>1_SYSTEM_CLOCK_FLASH</name>
							<description>1 system clock flash access time (for system clock frequencies of up to 20 MHz).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_SYSTEM_CLOCKS_FLAS</name>
							<description>2 system clocks flash access time (for system clock frequencies of up to 40 MHz).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_SYSTEM_CLOCKS_FLAS</name>
							<description>3 system clocks flash access time (for system clock frequencies of up to 50 MHz).</description>
							<value>0x2</value>
						</enumeratedValue>
						
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. User software must not change the value of these bits. Bits 31:2 must be written back exactly as read.</description>
					<bitRange>[31:2]</bitRange>
				
