0xsmirk/mcu_cmsis_svd/NXP/LPC11Axxv0.6.svd
			</registers>
		</peripheral>
		
		

		<peripheral>
	<name>IOCON</name>
	<description>IOCON block</description>
	<groupName>IOCON</groupName>
	<baseAddress>0x40044000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
		

<registers>
   <register>
      <name>RESET_PIO0_0</name>
      <description>I/O configuration register for pin RESET/PIO0_0</description>
      <addressOffset>0x0</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000090</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin RESET/PIO0_0</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>RESET</name>
                  <description>External reset input with fixed 20 ns glitch filter: A
                                    LOW on this pin resets the device, causing I/O ports and
                                    peripherals to take on their default states and processor
                                    execution to begin at address 0. </description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PIO0_0</name>
                  <description>General purpose digital input/output pin.</description>
                  <value>0x1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>SLOW</name>
                  <description>Slow. More outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>PIO0_1</name>
      <description>I/O configuration register for pin PIO0_1/RXD/CLKOUT/ CT32B0_MAT2/SSEL0/ CLKIN</description>
      <addressOffset>0x4</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000090</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin PIO0_1/RXD/CLKOUT/ CT32B0_MAT2/SSEL0/ CLKIN</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>PIO0_1</name>
                  <description>General purpose digital input/output pin. A LOW level on
                                    this pin during reset starts the ISP command
                                    handler.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>RXD</name>
                  <description>Receiver data input for USART.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CLKOUT</name>
                  <description>Clock output.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT32B0_MAT2</name>
                  <description>Match output 2 for 32-bit timer 0.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SSEL0</name>
                  <description>Slave Select for SSP0.</description>
                  <value>0x4</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CLKIN</name>
                  <description>External clock input.</description>
                  <value>0x5</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>SLOW</name>
                  <description>Slow. More outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>PIO0_2</name>
      <description>I/O configuration register for pin PIO0_2/SCL/ACMP_O/ TCK/SWCLK/ CT16B0_CAP0</description>
      <addressOffset>0x8</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000080</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin PIO0_2/SCL/ACMP_O/ TCK/SWCLK/ CT16B0_CAP0</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>PIO0_2</name>
                  <description>General purpose digital input/output pin. High-current
                                    sink (20 mA) or standard-current sink (4 mA) programmable; true
                                    open-drain for all pin functions. Input glitch filter (50 ns)
                                    capable.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SCL</name>
                  <description>I2C-bus clock (true                                     open-drain) input/output. Input glitch filter (50 ns)                                     capable.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ACMP_O</name>
                  <description>Analog comparator output.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>TCK_SWCLK</name>
                  <description>Serial Wire Debug Clock (secondary for LQFP and HVQFN                                     packages). Input glitch filter (50 ns) capable. For the WLCSP20                                     package only, this pin is configured to the SWCLK function by                                     the boot loader after reset.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT16B0_CAP0</name>
                  <description>Capture input 0 for 16-bit timer 0.Input glitch filter                                     (50 ns) capable.</description>
                  <value>0x4</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[7:3]</bitRange>
         </field>
         <field>
            <name>HS</name>
            <description>Controls glitch filter and slew rate.</description>
            <bitRange>[8:8]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled. </description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HIDRIVE</name>
            <description>Controls sink current.</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard; 4 mA sink current.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>HIGH</name>
                  <description>High; 20 mA sink current.</description>
                  <value>0x1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:10]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>PIO0_3</name>
      <description>I/O configuration register for pin PIO0_3/SDA/ACMP_O/ SWDIO/CT16B1_CAP0</description>
      <addressOffset>0xC</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000080</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin PIO0_3/SDA/ACMP_O/ SWDIO/CT16B1_CAP0</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>PIO0_3</name>
                  <description>General purpose digital input/output pin. High-current
                                    sink (20 mA) or standard-current sink (4 mA) programmable; true
                                    open-drain for all pin functions. Input glitch filter (50 ns)
                                    capable.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SDA</name>
                  <description>I2C-bus data (true open-drain)                                     input/output. Input glitch filter (50 ns) capable.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ACMP_O</name>
                  <description>Analog comparator output.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SWDIO</name>
                  <description>Serial Wire Debug I/O (secondary for LQFP and HVQFN                                     packages). Input glitch filter (50 ns) capable. For the WLCSP20                                     package only, this pin is configured to the SWDIO function by                                     the boot loader after reset.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT16B1_CAP0</name>
                  <description>Capture input 0 for 16-bit timer 1. Input glitch filter                                     (50 ns) capable.</description>
                  <value>0x4</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[7:3]</bitRange>
         </field>
         <field>
            <name>HS</name>
            <description>Controls glitch filter and slew rate.</description>
            <bitRange>[8:8]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled. </description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HIDRIVE</name>
            <description>Controls sink current.</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard; 4 mA sink current.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>HIGH</name>
                  <description>High; 20 mA sink current.</description>
                  <value>0x1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:10]</bitRange>
         </field>
      </fields>
   </register>
